# mapping.py

latin_to_greek = {
    'A': 'α', 'B': 'β', 'C': 'χ', 'D': 'δ', 'E': 'ε',
    'F': 'φ', 'G': 'γ', 'H': 'η', 'I': 'ι', 'J': 'ϳ',
    'K': 'κ', 'L': 'λ', 'M': 'μ', 'N': 'ν', 'O': 'ο',
    'P': 'π', 'Q': 'ϙ', 'R': 'ρ', 'S': 'σ', 'T': 'τ',
    'U': 'υ', 'V': 'ϝ', 'W': 'ω', 'X': 'ξ', 'Y': 'ψ',
    'Z': 'ζ',
    'a': 'α', 'b': 'β', 'c': 'χ', 'd': 'δ', 'e': 'ε',
    'f': 'φ', 'g': 'γ', 'h': 'η', 'i': 'ι', 'j': 'ϳ',
    'k': 'κ', 'l': 'λ', 'm': 'μ', 'n': 'ν', 'o': 'ο',
    'p': 'π', 'q': 'ϙ', 'r': 'ρ', 's': 'σ', 't': 'τ',
    'u': 'υ', 'v': 'ϝ', 'w': 'ω', 'x': 'ξ', 'y': 'ψ',
    'z': 'ζ'
}

# Reverse mapping
greek_to_latin = {v: k for k, v in latin_to_greek.items()}
